pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_hci.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_usb_hmsc_hci.c
* Description  : USB Host MSC BOT driver
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Support Multi device.
***********************************************************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"
#include "r_usb_hatapi_define.h"    /* Peripheral ATAPI Device extern */
#include "r_usb_hmsc_define.h"   /* Host Mass Storage Class Driver define */
#include "r_usb_hmsc_extern.h"   /* Host MSC grobal define */
#include "r_usb_api.h"
#include "r_usb_hmsc_api.h"
#include "r_usb_hmsc_config.h"

/******************************************************************************
Renesas Abstracted HMSC Driver functions
******************************************************************************/

/******************************************************************************
Function Name   : usb_hmsc_SendCbw
Description     : Send CBW
Arguments       : uint16_t drvnum           : Drive Number
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_SendCbw(USB_UTR_t *ptr, uint16_t drvnum)
{
    USB_ER_t    err;
    uint16_t    msgnum;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_CBW_ERR;
    }

    /* Set CBW TAG */
    usb_hmsc_CbwTagCount(ptr, msgnum);

    /* Request CBW */
    /* Device number */
    usb_ghmsc_TransData[ptr->ip][msgnum].keyword     = msgnum;
    /* Transfer data address */
    usb_ghmsc_TransData[ptr->ip][msgnum].tranadr     = (void*)&usb_ghmsc_Cbw[ptr->ip][msgnum];
    /* Transfer data length */
    usb_ghmsc_TransData[ptr->ip][msgnum].tranlen     = (uint32_t)USB_MSC_CBWLENGTH;
    /* Not control transfer */
    usb_ghmsc_TransData[ptr->ip][msgnum].setup           = 0;
    usb_ghmsc_TransData[ptr->ip][msgnum].segment     = USB_TRAN_END;
    /* Call Back Function Info */
    usb_ghmsc_TransData[ptr->ip][msgnum].complete    = (USB_CB_t)&usb_cstd_DummyFunction;

    err = usb_hmsc_Submitutr(ptr, (uint16_t)USB_DATA_NONE, &usb_ghmsc_TransData[ptr->ip][msgnum]);

    return (err);
}   /* eof usb_hmsc_SendCbw() */

/******************************************************************************
Function Name   : usb_hmsc_SendCbwReq
Description     : Send CBW
Arguments       : uint16_t drvnum           : Drive Number
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_SendCbwReq(USB_UTR_t *ptr, uint16_t drvnum)
{
    USB_ER_t    err;
    uint16_t    msgnum;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_SUBMIT_ERR;
    }
    /* Call Back Function Info */
    usb_ghmsc_TransData[ptr->ip][msgnum].complete    = &usb_hmsc_CheckResult;

    err = usb_hmsc_SubmitutrReq(ptr, (uint16_t)USB_DATA_NONE, &usb_ghmsc_TransData[ptr->ip][msgnum]);
    if( err != USB_E_OK ) 
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", drvnum);
        return USB_HMSC_SUBMIT_ERR;
    }
    return (err);
}   /* eof usb_hmsc_SendCbwReq() */

/******************************************************************************
Function Name   : usb_hmsc_SendCbwCheck
Description     : Check send CBW 
Arguments       : uint16_t drvnum           : Drive Number
                : uint16_t hmsc_retval      : Return Value
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_SendCbwCheck(USB_UTR_t *ptr, uint16_t drvnum, uint16_t hmsc_retval)
{
    uint16_t    pipeno, msgnum;
    USB_CLSINFO_t mess;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_CBW_ERR;
    }
    /* NonOS */
    switch( hmsc_retval ) 
    {
    case USB_DATA_NONE:     /* Send CBW */
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_OutPipe[ptr->ip][msgnum][0]);
        usb_ghmsc_OutPipe[ptr->ip][msgnum][1] = usb_ghmsc_TransData[ptr->ip][msgnum].pipectr;
        return USB_HMSC_OK;
        break;
    case USB_DATA_STALL:    /* Stall */
        USB_PRINTF1("*** CBW Transfer STALL(drive:%d) !\n", drvnum);
        usb_shmsc_Process[ptr->ip] = USB_MSG_HMSC_CBW_ERR;
        usb_shmsc_StallErrSeq[ptr->ip] = USB_SEQ_0;
        mess.keyword = drvnum;

