pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_hci.c
        mess.ip = ptr->ip;
        mess.ipp = ptr->ipp;

        usb_hmsc_SpecifiedPath(&mess);
        return USB_DATA_STALL;
        break;
    case USB_DATA_TMO:      /* Timeout */
        USB_PRINTF1("### CBW Transfer timeout ERROR(drive:%d) !\n", drvnum);
        pipeno  = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_OutPipe[ptr->ip][msgnum][0]);
        R_usb_hstd_TransferEnd(ptr, pipeno, (uint16_t)USB_DATA_TMO);
        break;
    case USB_DATA_ERR:
        USB_PRINTF1("### CBW Transfer ERROR(drive:%d) !\n", drvnum);
        break;
    default:
        USB_PRINTF1("### CBW Transfer error(drive:%d) !\n", drvnum);
        break;
    }
    return USB_HMSC_CBW_ERR;
}   /* eof usb_hmsc_SendCbwCheck() */

/******************************************************************************
Function Name   : usb_hmsc_GetData
Description     : Receive Data request
Arguments       : uint16_t drvnum           : Drive Number
                : uint8_t *buff             : Receive Data Buffer Address
                : uint32_t size             : Receive Data Size
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetData(USB_UTR_t *ptr, uint16_t drvnum, uint8_t *buff, uint32_t size)
{
    uint16_t    msgnum;
    USB_ER_t    err;

    msgnum  = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        USB_PRINTF1("### usb_hmsc_GetData [usb_hmsc_SmpDrive2Msgnum]error(drvnum:%d) !\n", drvnum);
        return USB_HMSC_DAT_RD_ERR;
    }
    /* Device number */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].keyword   = msgnum;
    /* Transfer data address */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].tranadr   = (void*)buff;
    /* Transfer data length */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].tranlen   = size;
    /* Not control transfer */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].setup     = 0;
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].segment   = USB_TRAN_END;
    /* Call Back Function Info */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].complete  = (USB_CB_t)&usb_cstd_DummyFunction;

    err = usb_hmsc_Submitutr(ptr, (uint16_t)USB_DATA_OK, &usb_ghmsc_ReceiveData[ptr->ip][msgnum]);
    return (err);
}   /* eof usb_hmsc_GetData() */

/******************************************************************************
Function Name   : usb_hmsc_GetDataReq
Description     : Get Data request
Arguments       : uint16_t drvnum           : Drive Number
                : uint8_t *buff             : Not use
                : uint32_t size             : Not use
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetDataReq(USB_UTR_t *ptr, uint16_t drvnum, uint8_t *buff, uint32_t size)
{
    USB_ER_t    err;
    uint16_t    msgnum;

    msgnum  = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        USB_PRINTF1("### usb_hmsc_GetDataReq [usb_hmsc_SmpDrive2Msgnum]error(drvnum:%d) !\n", drvnum);
        return USB_HMSC_DAT_RD_ERR;
    }

    /* Call Back Function Info */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].complete  = &usb_hmsc_CheckResult;

    err = usb_hmsc_SubmitutrReq(ptr, (uint16_t)USB_DATA_OK, &usb_ghmsc_ReceiveData[ptr->ip][msgnum]);
    if( err != USB_E_OK ) 
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", drvnum);
        return USB_HMSC_SUBMIT_ERR;
    }
    return (err);
}   /* eof usb_hmsc_GetDataReq() */

/******************************************************************************
Function Name   : usb_hmsc_GetDataCheck
Description     : Check Get Data 
Arguments       : uint16_t drvnum           : Drive Number
                : uint16_t hmsc_retval      : Return Value
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetDataCheck(USB_UTR_t *ptr, uint16_t drvnum, uint16_t hmsc_retval)
{
    uint16_t pipeno, msgnum;
    
    msgnum  = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        USB_PRINTF1("### usb_hmsc_GetDataCheck 1 [usb_hmsc_SmpDrive2Msgnum]error(drvnum:%d) !\n", drvnum);
        return USB_HMSC_DAT_RD_ERR;
    }

    /* NonOS */
    switch( hmsc_retval ) 
    {
    case USB_DATA_SHT:
        /* Continue */
    case USB_DATA_OK:
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_InPipe[ptr->ip][msgnum][0]);
        usb_ghmsc_InPipe[ptr->ip][msgnum][1] = usb_ghmsc_ReceiveData[ptr->ip][msgnum].pipectr;
        return  USB_HMSC_OK;
        break;
    case USB_DATA_STALL:
        USB_PRINTF1("*** GetData Read STALL(drive:%d) !\n", drvnum);
        R_usb_hmsc_ClearStall(ptr, (uint16_t)USB_DATA_OK, msgnum, (USB_CB_t)usb_hmsc_ClearStallCheck2);
        return  USB_HMSC_STALL;
        break;
    case USB_DATA_TMO:
        USB_PRINTF1("### hmsc_Data Read timeout ERROR(drive:%d) !\n", drvnum);
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_InPipe[ptr->ip][msgnum][0]);
        R_usb_hstd_TransferEnd(ptr, pipeno, (uint16_t)USB_DATA_TMO);
        break;
    case USB_DATA_ERR:
        USB_PRINTF1("### hmsc_Data Read ERROR(drive:%d) !\n", drvnum);
        break;
    case USB_DATA_OVR:
        USB_PRINTF1("### hmsc_Data receive over(drive:%d) !\n", drvnum);
        break;
    default:
        USB_PRINTF1("### hmsc_Data Read error(drive:%d) !\n", drvnum);
        break;
    }
    USB_PRINTF1("### usb_hmsc_GetDataCheck 2 [usb_hmsc_SmpDrive2Msgnum]error(drvnum:%d) !\n", drvnum);
    return USB_HMSC_DAT_RD_ERR;
}   /* eof usb_hmsc_GetDataCheck() */

/******************************************************************************
Function Name   : usb_hmsc_SendData
Description     : Send Pipe Data
Arguments       : uint16_t drvnum           : Drive Number
                : uint8_t  *buff            : Data Info Address
                : uint32_t size             : Data Size
Return value    : uint16_t                  : Error Code(USB_DONE)
******************************************************************************/
uint16_t usb_hmsc_SendData(USB_UTR_t *ptr, uint16_t drvnum, uint8_t *buff, uint32_t size)
{
    uint16_t    msgnum;
    USB_ER_t    err;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_DAT_WR_ERR;
    }
    /* Device number */
    usb_ghmsc_TransData[ptr->ip][msgnum].keyword     = msgnum;
    /* Transfer data address */
    usb_ghmsc_TransData[ptr->ip][msgnum].tranadr     = (void*)buff;
    /* Transfer data length */
    usb_ghmsc_TransData[ptr->ip][msgnum].tranlen     = size;
    /* Not control transfer */
    usb_ghmsc_TransData[ptr->ip][msgnum].setup       = 0;
    usb_ghmsc_TransData[ptr->ip][msgnum].segment     = USB_TRAN_END;
    /* Call Back Function Info */
    usb_ghmsc_TransData[ptr->ip][msgnum].complete
        = (USB_CB_t)&usb_cstd_DummyFunction;

    err = usb_hmsc_Submitutr(ptr, (uint16_t)USB_DATA_NONE
        , &usb_ghmsc_TransData[ptr->ip][msgnum]);
    return err;
}   /* eof usb_hmsc_SendData() */

