pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_hci.c
/******************************************************************************
Function Name   : usb_hmsc_SendDataReq
Description     : Send Pipe Data
Arguments       : uint16_t drvnum           : Drive Number
                : uint8_t  *buff            : Data Info Address
                : uint32_t size             : Data Size
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_SendDataReq(USB_UTR_t *ptr, uint16_t drvnum, uint8_t *buff, uint32_t size)
{
    USB_ER_t    err;
    uint16_t    msgnum;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_DAT_WR_ERR;
    }
    /* Call Back Function Info */
    usb_ghmsc_TransData[ptr->ip][msgnum].complete    = &usb_hmsc_CheckResult;

    err = usb_hmsc_SubmitutrReq(ptr, (uint16_t)USB_DATA_NONE, &usb_ghmsc_TransData[ptr->ip][msgnum]);
    if( err != USB_E_OK ) 
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", drvnum);
        return USB_HMSC_SUBMIT_ERR;
    }
    return (err);
}   /* eof usb_hmsc_SendDataReq() */

/******************************************************************************
Function Name   : usb_hmsc_SendDataCheck
Description     : Check Send Data
Arguments       : uint16_t drvnum           : Drive Number
                : uint16_t hmsc_retval      : Return Value
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_SendDataCheck(USB_UTR_t *ptr, uint16_t drvnum, uint16_t hmsc_retval)
{
    uint16_t    pipeno, msgnum;
    
    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_DAT_WR_ERR;
    }

    switch( hmsc_retval ) 
    {
    case USB_DATA_NONE:
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_OutPipe[ptr->ip][msgnum][0]);
        usb_ghmsc_OutPipe[ptr->ip][msgnum][1] = usb_ghmsc_TransData[ptr->ip][msgnum].pipectr;
        return USB_HMSC_OK;
        break;
    case USB_DATA_STALL:
        USB_PRINTF1("*** hmsc_Data Write STALL(drive:%d) !\n", drvnum);
        R_usb_hmsc_ClearStall(ptr, (uint16_t)USB_DATA_NONE, msgnum, (USB_CB_t)usb_hmsc_ClearStallCheck2);
        return USB_HMSC_STALL;
        break;
    case USB_DATA_TMO:
        USB_PRINTF1("### hmsc_Data Write timeout ERROR(drive:%d) !\n", drvnum);
        pipeno  = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_OutPipe[ptr->ip][msgnum][0]);
        R_usb_hstd_TransferEnd(ptr, pipeno, (uint16_t)USB_DATA_TMO);
        break;
    case USB_DATA_ERR:
        USB_PRINTF1("### hmsc_Data Write ERROR(drive:%d) !\n", drvnum);
        break;
    default:
        USB_PRINTF1("### hmsc_Data Write error(drive:%d) !\n", drvnum);
        break;
    }
    return USB_HMSC_DAT_WR_ERR;
}   /* eof usb_hmsc_SendDataCheck() */

/******************************************************************************
Function Name   : usb_hmsc_GetCsw
Description     : Receive CSW
Arguments       : uint16_t drvnum           : Drive Number
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetCsw(USB_UTR_t *ptr, uint16_t drvnum)
{
    uint16_t    msgnum;
    USB_ER_t    err;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_CSW_ERR;
    }

    /* Request */
    /* Device number */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].keyword   = msgnum;
    /* Transfer data address */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].tranadr   = (void*)&usb_ghmsc_Csw[ptr->ip][msgnum];
    /* Transfer data length */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].tranlen   = (uint32_t)USB_MSC_CSW_LENGTH;
    /* Not control transfer */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].setup     = 0;
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].segment   = USB_TRAN_END;
    /* Call Back Function Info */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].complete  = (USB_CB_t)&usb_cstd_DummyFunction;

    err = usb_hmsc_Submitutr(ptr, (uint16_t)USB_DATA_OK, &usb_ghmsc_ReceiveData[ptr->ip][msgnum]);
    return err;
}   /* eof usb_hmsc_GetCsw() */

/******************************************************************************
Function Name   : usb_hmsc_GetCswReq
Description     : Request Receive CSW
Arguments       : uint16_t drvnum           : Drive Number
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetCswReq(USB_UTR_t *ptr, uint16_t drvnum)
{
    USB_ER_t    err;
    uint16_t    msgnum;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_CSW_ERR;
    }

    /* Transfer data length */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].tranlen   = (uint32_t)USB_MSC_CSW_LENGTH;
    /* Call Back Function Info */
    usb_ghmsc_ReceiveData[ptr->ip][msgnum].complete  = &usb_hmsc_CheckResult;

    err = usb_hmsc_SubmitutrReq(ptr, (uint16_t)USB_DATA_OK, &usb_ghmsc_ReceiveData[ptr->ip][msgnum]);
    if( err != USB_E_OK ) 
    {
        USB_PRINTF1("### Mass Storage Device Class submit error(drive:%d) !\n", drvnum);
        return USB_HMSC_SUBMIT_ERR;
    }
    return (err);
}   /* eof usb_hmsc_GetCswReq() */

/******************************************************************************
Function Name   : usb_hmsc_GetCswCheck
Description     : Check Receive CSW
Arguments       : uint16_t drvnum           : Drive Number
                : uint16_t hmsc_retval      : Return Value
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetCswCheck(USB_UTR_t *ptr, uint16_t drvnum, uint16_t hmsc_retval)
{
    uint16_t        pipeno, msgnum;

    msgnum = usb_hmsc_SmpDrive2Msgnum(ptr, drvnum);
    if( USB_ERROR == msgnum )
    {
        return USB_HMSC_CSW_ERR;
    }

    switch( hmsc_retval ) 
    {
    case USB_DATA_SHT:
        /* Continue */
    case USB_DATA_OK:
        /* CSW Check */
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_InPipe[ptr->ip][msgnum][0]);
        usb_ghmsc_InPipe[ptr->ip][msgnum][1] = usb_ghmsc_ReceiveData[ptr->ip][msgnum].pipectr;
        return usb_hmsc_CheckCsw(ptr, drvnum);
        break;
    case USB_DATA_STALL:
        /* Stall */
        USB_PRINTF1("*** GetCSW Transfer STALL(drive:%d) !\n", drvnum);
        return USB_MSG_HMSC_DATA_STALL;
        break;
    case USB_DATA_TMO:
        /* Timeout */
        USB_PRINTF1("### usb_hmscCSW Transfer timeout ERROR(drive:%d) !\n", drvnum);
        pipeno = R_usb_hmsc_Information(ptr->ip, usb_ghmsc_InPipe[ptr->ip][msgnum][0]);
        R_usb_hstd_TransferEnd(ptr, pipeno, (uint16_t)USB_DATA_TMO);
        break;
    case USB_DATA_ERR:
        USB_PRINTF1("### usb_hmscCSW Transfer ERROR(drive:%d) !\n"
            , drvnum);
        break;
    case USB_DATA_OVR:
        USB_PRINTF1("### usb_hmscCSW receive over(drive:%d) !\n", drvnum);
        break;
    default:
        USB_PRINTF1("### usb_hmscCSW Transfer error(drive:%d) !\n", drvnum);
        break;
    }
    return USB_HMSC_CSW_ERR;
}   /* eof usb_hmsc_GetCswCheck() */

