pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_hci.c
/******************************************************************************
Function Name   : usb_hmsc_GetStringInfoCheck
Description     : Check Get string descriptor infomation
Arguments       : uint16_t devaddr          : Device Address
Return value    : uint16_t                  : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetStringInfoCheck(USB_UTR_t *ptr, uint16_t devaddr)
{
/* Condition compilation by the difference of useful function */
 #ifdef USB_DEBUGPRINT_PP
    uint32_t    j;
    uint8_t     pdata[32];
 #endif /* USB_DEBUGPRINT_PP */

    if( usb_ghmsc_ClassData[ptr->ip][0] < (uint8_t)(30 * 2 + 2) ) 
    {
        USB_PRINTF0("*** Serial Number short\n");
        usb_ghmsc_ClassData[ptr->ip][0]  = (uint8_t)(usb_ghmsc_ClassData[ptr->ip][0] / 2);
        usb_ghmsc_ClassData[ptr->ip][0]  = (uint8_t)(usb_ghmsc_ClassData[ptr->ip][0] - 1);
    } 
    else 
    {
        usb_ghmsc_ClassData[ptr->ip][0]  = 30;
    }
/* Condition compilation by the difference of useful function */
 #ifdef USB_DEBUGPRINT_PP
    for( j = (uint16_t)0; j < usb_ghmsc_ClassData[ptr->ip][0]; j++ ) 
    {
        pdata[j]    = usb_ghmsc_ClassData[ptr->ip][j * (uint16_t)2 + (uint16_t)2];
    }
    pdata[usb_ghmsc_ClassData[ptr->ip][0]] = 0;
    USB_PRINTF1("    Serial Number : %s\n", pdata);
    if( usb_ghmsc_ClassData[ptr->ip][0] < (uint8_t)(12 * 2 + 2) ) 
    {
    }
 #endif /* USB_DEBUGPRINT_PP */
    return USB_DONE;
}   /* eof usb_hmsc_GetStringInfoCheck() */

/******************************************************************************
Function Name   : usb_hmsc_GetMaxUnitCheck
Description     : Check Get Max LUN request
Argument        : uint16_t err              : Error Code
Return value    : USB_ER_t                 : Error Code
******************************************************************************/
uint16_t usb_hmsc_GetMaxUnitCheck(USB_UTR_t *ptr, uint16_t err)
{
    if( err == (uint16_t)USB_DATA_STALL ) 
    {
        USB_PRINTF0("*** GetMaxUnit not support !\n");
        return USB_ERROR;
    } 
    else if( err == (uint16_t)USB_DATA_TMO ) 
    {
        USB_PRINTF0("*** GetMaxUnit not support(time out) !\n");
        usb_hmsc_ControlEnd(ptr, (uint16_t)USB_DATA_TMO);
        return USB_ERROR;
    } 
    else if( err != (uint16_t)USB_CTRL_END ) 
    {
        USB_PRINTF1(
            "### [GetMaxUnit] control transfer error(%d) !\n", err);
        return USB_ERROR;
    } 
    else 
    {
    }
    return (usb_ghmsc_Data[ptr->ip][0]);
}   /* eof usb_hmsc_GetMaxUnitCheck() */

/******************************************************************************
Function Name   : usb_hmsc_MassStorageResetCheck
Description     : Check Mass Strage Reset request
Argument        : uint16_t err              : Error Code
Return value    : USB_ER_t                 : Error Code
******************************************************************************/
uint16_t usb_hmsc_MassStorageResetCheck(USB_UTR_t *ptr, uint16_t err)
{
    if( err == (uint16_t)USB_DATA_STALL ) 
    {
        USB_PRINTF0("*** MassStorageReset not support !\n");
        return USB_ERROR;
    } 
    else if( err == (uint16_t)USB_DATA_TMO ) 
    {
        USB_PRINTF0("*** MassStorageReset not support(time out) !\n");
        usb_hmsc_ControlEnd(ptr, (uint16_t)USB_DATA_TMO);
        return USB_ERROR;
    } 
    else if( err != (uint16_t)USB_CTRL_END ) 
    {
        USB_PRINTF1("### [MassStorageReset] control transfer error(%d) !\n", err);
        return USB_ERROR;
    } 
    else 
    {
    }
    return USB_DONE;
}   /* eof usb_hmsc_MassStorageResetCheck() */

/******************************************************************************
Function Name   : usb_hmsc_ClearStall
Description     : Clear Stall
Arguments       : uint16_t Pipe : 
                : USB_CB_t complete : 
Return value    : uint16_t
******************************************************************************/
USB_ER_t usb_hmsc_ClearStall(USB_UTR_t *ptr, uint16_t Pipe, USB_CB_t complete)
{
    USB_ER_t    err;

    err = R_usb_hstd_ChangeDeviceState(ptr, (USB_CB_t)complete, USB_DO_CLR_STALL, Pipe);
    return err;
}   /* eof usb_hmsc_ClearStall() */

/******************************************************************************
Function Name   : usb_hmsc_ClearStallCheck
Description     : Clear Stall Check
Arguments       : uint16_t errcheck : 
Return value    : uint16_t
******************************************************************************/
void usb_hmsc_ClearStallCheck(USB_UTR_t *ptr, uint16_t errcheck)
{
    uint16_t retval;

    retval = usb_hmsc_StdReqCheck(errcheck);
    if( retval == USB_DONE )
    {
        /* Clear STALL */
        usb_cstd_ClrStall(ptr, (uint16_t)USB_PIPE0 );

        /* SQCLR */
        R_usb_hstd_ChangeDeviceState(ptr, (USB_CB_t)&usb_cstd_DummyFunction, USB_DO_CLR_SQTGL, (uint16_t)USB_PIPE0 );
    }
}   /* eof usb_hmsc_ClearStallCheck() */

/******************************************************************************
Function Name   : usb_hmsc_ClearStallCheck2
Description     : Clear Stall Check 2
Arguments       : USB_UTR_t *mess : 
Return value    : none
******************************************************************************/
void usb_hmsc_ClearStallCheck2(USB_UTR_t *mess)
{
    uint16_t errcheck;

    errcheck = mess->status;
    usb_hmsc_ClearStallCheck(mess, errcheck);

    mess->msginfo = usb_shmsc_Process[mess->ip];
    usb_hmsc_SpecifiedPath((USB_CLSINFO_t *)mess);
}   /* eof usb_hmsc_ClearStallCheck2() */

/******************************************************************************
Function Name   : usb_hmsc_Submitutr
Description     : Data transfer request
Argument        : uint16_t type             : Data Transmit/Data Receive
                : USB_UTR_t *utr_table     : Information Table
Return value    : USB_ER_t                 : Error Code
******************************************************************************/
USB_ER_t usb_hmsc_Submitutr(USB_UTR_t *ptr, uint16_t type, USB_UTR_t *utr_table)
{
    uint16_t    msgnum, pipeno, offset2;
    USB_ER_t    err;

