pwbf/RX64M_ETHERNET/r_usb_hmsc/src/r_usb_hmsc_hci.c
    usb_shmsc_MsgNum[ptr->ip] = utr_table->keyword;

    switch( type ) 
    {
    case USB_CTRL_END:                      /* Control transfer */
        break;
    case USB_DATA_NONE:                     /* Data transmit */
        msgnum              = utr_table->keyword;
        offset2             = usb_ghmsc_OutPipe[ptr->ip][msgnum][0];
        if( USB_NOPORT == offset2 )
        {
            USB_PRINTF3("### USB_NOPORT error IP[%d] MSGNUM[%d] OFFSET[%x]\n", ptr->ip, msgnum, offset2 );
            return USB_ERROR;
        }
        pipeno              = R_usb_hmsc_Information(ptr->ip, offset2);
        if( USB_PIPE5 < pipeno )
        {
            USB_PRINTF1("### PIPE No. error[%d]\n", pipeno);
            return USB_ERROR;
        }
        utr_table->keyword  = pipeno;
        R_usb_hstd_SetPipeInfo((uint16_t*)&usb_ghmsc_DefEpTbl[0], (uint16_t*)&usb_ghmsc_PipeTable[ptr->ip][offset2], 
            (uint16_t)USB_EPL);
        err = R_usb_hstd_SetPipeRegistration(ptr, (uint16_t*)&usb_ghmsc_DefEpTbl, pipeno);
        break;
    case USB_DATA_OK:                           /* Data recieve */
        msgnum              = utr_table->keyword;
        offset2             = usb_ghmsc_InPipe[ptr->ip][msgnum][0];
        if( USB_NOPORT == offset2 )
        {
            USB_PRINTF3("### USB_NOPORT error IP[%d] MSGNUM[%d] OFFSET[%x]\n", ptr->ip, msgnum, offset2 );
            return USB_ERROR;
        }
        pipeno              = R_usb_hmsc_Information(ptr->ip, offset2);
        if( USB_PIPE5 < pipeno )
        {
            USB_PRINTF1("### PIPE No. error[%d]\n", pipeno);
            return USB_ERROR;
        }
        utr_table->keyword  = pipeno;
        R_usb_hstd_SetPipeInfo((uint16_t*)&usb_ghmsc_DefEpTbl[0], (uint16_t*)&usb_ghmsc_PipeTable[ptr->ip][offset2], 
            (uint16_t)USB_EPL);
        err = R_usb_hstd_SetPipeRegistration(ptr, (uint16_t*)&usb_ghmsc_DefEpTbl, pipeno);
        break;
    default:
        break;
    }
    return err;
}   /* eof usb_hmsc_Submitutr() */

/******************************************************************************
Function Name   : usb_hmsc_SubmitutrReq
Description     : Data transfer request
Argument        : uint16_t type             : Data Transmit/Data Receive
                : USB_UTR_t *utr_table      : Information Table
Return value    : USB_ER_t                  : Error Code
******************************************************************************/
USB_ER_t usb_hmsc_SubmitutrReq(USB_UTR_t *ptr, uint16_t type, USB_UTR_t *utr_table)
{
    uint16_t    msgnum, pipeno;
    uint16_t    toggle;
    USB_ER_t    err;

    msgnum = usb_shmsc_MsgNum[ptr->ip];

    utr_table->ip = ptr->ip;
    utr_table->ipp = ptr->ipp;

    switch( type ) 
    {
    case USB_CTRL_END:                      /* Control transfer */
        err = R_usb_hstd_TransferStart(utr_table);
        break;
    case USB_DATA_NONE:                     /* Data transmit */
        pipeno = utr_table->keyword;

        if( (USB_SQMON & usb_ghmsc_OutPipe[ptr->ip][msgnum][1]) == USB_SQMON )
        {
            toggle = USB_SQ_DATA1;
        }
        else
        {
            toggle = USB_SQ_DATA0;
        }
        usb_hmsc_DoSqtgl(utr_table, pipeno, toggle);
        err = R_usb_hstd_TransferStart(utr_table);
        break;
    case USB_DATA_OK:                       /* Data recieve */
        pipeno = utr_table->keyword;

        if( (USB_SQMON & usb_ghmsc_InPipe[ptr->ip][msgnum][1]) == USB_SQMON )
        {
            toggle = USB_SQ_DATA1;
        }
        else
        {
            toggle = USB_SQ_DATA0;
        }
        usb_hmsc_DoSqtgl(utr_table, pipeno, toggle);
        err = R_usb_hstd_TransferStart(utr_table);
        break;
    default:
        USB_PRINTF0("### submit error\n");
        err = USB_HMSC_SUBMIT_ERR;
        break;
    }
    return err;
}   /* eof usb_hmsc_SubmitutrReq() */


/******************************************************************************
Function Name   : usb_hmsc_DoSqtgl
Description     : Set SQSET bit or SQCLR bit for Pipe control regstor(PIPEnCTR).
Argument        : USB_UTR_t *ptr        : The app's USB Comm. Structure.
                : uint16_t Pipe         : Pipe No.
                : uint16_t toggle       : Sequence Toggle bit(DATA0/DATA1)
Return value    : none
******************************************************************************/
void usb_hmsc_DoSqtgl(USB_UTR_t *ptr, uint16_t Pipe, uint16_t toggle)
{
    uint16_t msginfo;

    if( toggle == USB_SQ_DATA1 )
    {
        msginfo = USB_DO_SET_SQTGL;
    }
    else
    {
        msginfo = USB_DO_CLR_SQTGL;
    }

    R_usb_hstd_ChangeDeviceState(ptr, (USB_CB_t)&usb_cstd_DummyFunction, msginfo, Pipe);
}   /* eof usb_hmsc_DoSqtgl() */

/******************************************************************************
Function Name   : usb_hmsc_ControlEnd
Description     : Control end function
Argument        : uint16_t  sts             : Status
Return value    : none
******************************************************************************/
void usb_hmsc_ControlEnd(USB_UTR_t *ptr, uint16_t sts)
{
        R_usb_hstd_TransferEnd(ptr, USB_PIPE0, sts);
}   /* eof usb_hmsc_ControlEnd() */

/******************************************************************************
End  Of File
******************************************************************************/

